Revit 2024 API
AnalysisDisplayMarkersAndTextSettings Members
The AnalysisDisplayMarkersAndTextSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayMarkersAndTextSettings()
 Constructs a default instance of markers and text settings.
AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings)
 Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayMarkersAndTextSettings
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Compares two colored surface settings objects.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MarkerSize
 Size of marker.
MarkerType
 Type of marker.
Rounding
 Increment to which numeric values of analysis results are rounded in markers.
TextLabelType
 Type of diagram text label visualization.
TextTypeId
 Element id of text associated with the settings.
See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace